first_routes/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["email", "John_jacob@g.com"], ["updated_at", "2018-11-12 23:10:37.514888"], ["id", 1]]
---
  def update
    user = User.find(params[:id])
    if user.update(user_params)